{
  "title": "Lead Data Scientist - 6+years (Data Science/Machine Learning/Data Analytics)",
  "company": "Silicon Labs",
  "location": "Hyderabad",
  "description": "Silicon Labs (NASDAQ: SLAB) is the leading innovator in low-power wireless connectivity, building embedded technology that connects devices and improves lives. Merging cutting-edge technology into the world’s most highly integrated SoCs, Silicon Labs provides device makers the solutions, support, and ecosystems needed to create advanced edge connectivity applications. Headquartered in Austin, Texas, Silicon Labs has operations in over 16 countries and is the trusted partner for innovative solutions in the smart home, industrial IoT, and smart cities markets. Learn more at www.silabs.com.\n\nWhat You'll do\n\nLead and execute complex data science initiatives that support high-impact business decisions.\n\nResponsible for the development, deployment, and communication of advanced analytical models.\n\nProvides technical guidance to junior data scientists and partners closely with cross-functional teams to drive data-driven outcomes\n\nResponsibilities\n• Designs and implements advanced statistical and machine learning models to solve complex business problems.\n• Leads full-cycle analytics projects, including problem definition, data exploration, model development, evaluation, and deployment.\n• Collaborates with stakeholders to align data science solutions with business goals and priorities.\n• Provides technical mentorship to junior team members and contributes to knowledge sharing across the team.\n• Translates complex modeling outputs into actionable insights and presents findings to senior leadership.\n• Stays current on industry best practices and emerging trends in AI, machine learning, and data science tools.\n• Contributes to continuous improvement in analytical workflows, code standards, and data governance.\n• Applies sound judgment to navigate ambiguous problems and propose scalable solutions.\n• Performs other duties as required in support of the data science team and organizational goals.\n\nRequired Qualification and skills\n• Bachelor’s degree in Data Science, Computer Science, Statistics, Mathematics, or a related field; Master’s preferred.\n• Minimum of 4 years of experience in data science, machine learning, or advanced analytics.\n• Advanced proficiency in Python or R, SQL, and machine learning libraries (e.g., scikit-learn, TensorFlow).\n• Strong grasp of statistical analysis, experimental design, and model evaluation techniques.\n• Excellent written and verbal communication skills, with the ability to influence both technical and non-technical stakeholders.\n• Demonstrated experience in leading complex data projects and driving measurable business outcomes.\n• Experience with cloud-based data platforms (e.g., AWS, GCP, Azure) and MLOps practices is a plus.\n\nBenefits & Perks:\n\nNot only will you be joining a highly skilled and tight-knit team where every engineer makes a significant impact on the product; we also strive for good work/life balance and to make our environment welcoming and fun.\n• Equity Rewards (RSUs)\n• Employee Stock Purchase Plan (ESPP)\n• Insurance plans with Outpatient cover\n• National Pension Scheme (NPS)\n• Flexible work policy\n• Childcare support\n\nSilicon Labs is an equal opportunity employer and values the diversity of our employees. Employment decisions are made on the basis of qualifications and job-related criteria without regard to race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status, or any other characteristic protected by applicable law.",
  "employment_type": "Full-time",
  "posted_at": "2025-07-07T00:00:00.000Z",
  "apply_link": "https://in.linkedin.com/jobs/view/lead-data-scientist-6%2Byears-data-science-machine-learning-data-analytics-at-silicon-labs-4262154111?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
  "salary": "Not specified"
}