{
  "title": "Data Scientist Lead - Data Analytics",
  "company": "JPMorgan Chase & Co.",
  "location": "Hyderabad",
  "description": "We offer a unique opportunity to collaborate with brilliant minds and deliver premier solutions that set a new standard.\n\nAs a Data Scientist lead within the Data and Analytics team, you will drive the analytics book of work, transforming Chase’s cross-channel, cross-line of business acquisition strategy to a hyper-personalized, data-driven, customer-centric model. You will partner strategically across the firm with marketers, channel owners, digital experts, and the broader analytics community to help drive business goals through deep understanding of marketing analytics and optimization.\n\nJob Responsibilities:\n• Develop the analytics framework and data infrastructure necessary to support the platform team in evaluating value addition.\n• Define and assess the OKRs and goals related to the platform's performance.\n• Provide top-tier business intelligence through dashboards and executive reporting to the Acquisitions Center of Excellence and Line of Business leadership.\n• Construct business cases that drive prioritization and investment in Acquisition & Enablement Platforms.\n• Communicate effectively with product, technology, data, and design teams to identify and advance a data-driven analytical roadmap.\n• Serve as the Acquisition Center of Excellence Analytics local site lead, overseeing local operations and contributing to the expansion of the team's presence in India.\n\nRequired Qualifications, Capabilities, and Skills:\n• 5+ years leveraging data visualization tools for data exploration and marketing performance evaluation.\n• Proven ability to lead and manage teams effectively, showcasing strong leadership skills.\n• Experience in querying big data platforms and SAS/SQL.\n• Comfort building and managing relationships with both analytics and business stakeholders.\n• Proven track record of problem-solving using data and building new analytics capabilities. Talent for translating numbers into an actionable story for business leaders.\n• Experience with best-in-class web analytic tools (Google Analytics, Adobe/Omniture Insight/Visual Sciences, Webtrends, CoreMetrics, .\n• Superior written, oral communication and presentation skills with experience communicating concisely and effectively with all levels of management and partners.\n• Bachelor’s degree is required, with data science, mathematics, statistics, econometrics, engineering, MIS, finance, or related fields accordingly.\n\nPreferred Qualifications, Capabilities, and Skills:\n• Financial services experience preferred.\n• Tableau experience preferred.\n• Familiarity with Teradata, AWS, & Snowflake preferred.",
  "employment_type": "Full-time",
  "posted_at": "2025-07-12T00:00:00.000Z",
  "apply_link": "https://in.expertini.com/jobs/job/data-scientist-lead-data-analytics-hyderabad-jpmorgan-chase-co-1831-16184663/amp/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
  "salary": "Not specified"
}