{
  "title": "Team Lead, Data Analysis",
  "company": "Zelis",
  "location": "Hyderabad",
  "description": "About Us\n\nZelis is modernizing the healthcare financial experience in the United States (U.S.) across payers, providers, and healthcare consumers. We serve more than 750 payers, including the top five national health plans, regional health plans, TPAs and millions of healthcare providers and consumers across our platform of solutions. Zelis sees across the system to identify, optimize, and solve problems holistically with technology built by healthcare experts – driving real, measurable results for clients.\n\nWhy We Do What We Do\n\nIn the U.S., consumers, payers, and providers face significant challenges throughout the healthcare financial journey. Zelis helps streamline the process by offering solutions that improve transparency, efficiency, and communication among all parties involved. By addressing the obstacles that patients face in accessing care, navigating the intricacies of insurance claims, and the logistical challenges healthcare providers encounter with processing payments, Zelis aims to create a more seamless and effective healthcare financial system.\n\nZelis India plays a crucial role in this mission by supporting various initiatives that enhance the healthcare financial experience. The local team contributes to the development and implementation of innovative solutions, ensuring that technology and processes are optimized for efficiency and effectiveness. Beyond operational expertise, Zelis India cultivates a collaborative work culture, leadership development, and global exposure, creating a dynamic environment for professional growth. With hybrid work flexibility, comprehensive healthcare benefits, financial wellness programs, and cultural celebrations, we foster a holistic workplace experience. Additionally, the team plays a vital role in maintaining high standards of service delivery and contributes to Zelis’ award-winning culture. \n\nPosition Overview\n\nThe UAT Team lead will be responsible for responsible for leading operational teams to meet client and internal team expectations in a timely, efficient manner. Should be able to work with creating and monitoring test plan, test scenarios, setup, execution of UAT testing and reviewing results for all healthcare claim editing related projects within the Payment Integrity department including but not limited to the testing of new data driven edits, configuration, platform initiatives, and UI initiatives. The individual must work well in a fast-paced, demanding environment and work towards process improvement along with daily tasks.\n\nObjECTIVES AND RESPONSIBILITIES\n• Supervises, coaches, and develop staff to ensure operational department expectations are met.\n• Regularly communicate any updates or changes in processes and documentation to all relevant team members, ensuring that the entire team is informed and aligned.\n• conducts weekly individual team meetings when necessary to advise departmental updates.\n• Assists in monitoring team and individual performance and KPIs to identify trends. Review and document staffing levels; coordinate Teams coverage to ensure operational deliveries are met.\n• Plans, coordinates, and organizes weekly reporting, monthly 1:1’s, and annual reviews.\n• Partners with recruiting and other matrix supervisors related to interviewing and hiring to ensure that our department is staffed with the best possible talent.\n• Reviews and handles timecard approvals and time off requests.\n• Respond and resolve escalated issues and assigned projects.\n• Improve operational management systems, processes, and best practices.\n• Perform end to end testing to ensure appropriate functionality, product integrity, accuracy, and quality of all changes and enhancements of the edit platform, Data Driven Edits PriZem (in-house system), Visium through the Payment Integrity (Claims Editing) process.\n• Analyze clinical and technical requirements and define the scope of UAT testing. Setup, develop and maintain detailed test scenarios, test suites, data, checklist and/or other documents as specified, ensuring test scenarios align to requirements, adhering to claim adjudication guidelines. While using best practices for software testing methodology and techniques.\n• Analyze and troubleshoot erroneous results, determine root cause, and suggest solutions.\n• Produce documents that are detailed, accurate, and in a consistent format, demonstrating strong analytical and documentation skills.\n• Continuous improvement and refinement of tests-based pre-production validation, post-production results and feedback from other groups (Configuration Department, Content Department and Operations teams) as needed.\n• Support multiple projects, initiatives, tasks, and maintenance releases while adhering to deadlines.\n• Maintain awareness of and ensure adherence to Zelis standards regarding privacy.\n\nWhat You Will Bring\n• Aptitude for problem-solving with technical skills to execute\n• Excellent problem solving and analytical skills.\n• Ability to prioritize and manage multiple concurrent projects.\n• Ability to work through others without direct supervisory responsibility within departments and across the organization.\n• Understanding medical coding and medical claims.\n• Understanding of the life of a claim, including adjusted/corrected claims.\n• Excellent attention to detail to assess issues and resolve in a timely manner.\n• Basic database skills using MS SQL.\n• Ability to identify key factors and decisions that will make a project successful.\n• Ability to see the big picture and learn new processes, technologies and envision how they could benefit Zelis.\n• Must have excellent communication and presentation skills to effectively interface with team members.\n\nEducation\n• 2-3 years of relevant experience or equivalent combination of education & work within healthcare payer or provider.\n• Knowledge of healthcare reimbursement methodologies and acceptable billing practices.\n• Knowledge of payer reimbursement policies, state and federal regulations and applicable industry standards.\n• Knowledge of claims adjudication process and interpret claim editing rules.\n• Certified coder (CCS, CCS-P or CPC), or registered health information technician (RHIA/RHIT), or RN, LPN with coding knowledge a plus.\n• Understanding of SQL Server 2000/2005/2008 is a plus.\n• Project management experience a plus.\n• Excellent written, oral and presentation skills and ability to communicate complex concepts.\n• Proficient in Microsoft Office, Word, Excel.",
  "employment_type": "Full-time",
  "posted_at": "2025-07-25T00:00:00.000Z",
  "apply_link": "https://in.linkedin.com/jobs/view/team-lead-data-analysis-at-zelis-4275569263?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
  "salary": "Not specified"
}