{
  "title": "Lead Data Scientist – SFE Analytics",
  "company": "Gramener",
  "location": "Hyderabad",
  "description": "Work Location: Hyderabad\n\nWhat Gramener offers you\n\nGramener will offer you an inviting workplace, talented colleagues from diverse backgrounds, career path, steady growth prospects with great scope to innovate. Our goal is to create an ecosystem of easily configurable data applications focused on storytelling for public and private use\n\nRoles and Responsibilities\n• Worked extensively on SFE Analytics (Pharma preferred).\n• Deep understanding of Pharma Data (internal & external), best practices, and utilization of the data to drive the needed outcomes.\n• Strong expertise & understanding of the analytics to perform (at least 2 out of 4):\n\n– Territory designing & balancing. – FF alignment. – Call planning management. – Incentive & target management.\n• Analysing cross-channel marketing & commercial interventions, help build use case, value estimation & implementation.\n• Work with the business/functional users to understand the business decision-making and sales & marketing process challenges to recommend data-led solutions.\n• Assist in collecting, cleaning, and pre-processing data from various sources to build usable datasets.\n• Leverage advanced data analytics to address the business needs and create a business impact.\n• Design data science solutions in collaboration with technology architects to address this need.\n• Strong affiliation with quantitative methods and data analysis to deliver business insights.\n• Technical skills required (non-Negotiable): Excel, SQL, Python / R.\n\nSkills And Qualifications\n• Minimum 4+ years of experience in a reputed medium to large-scale manufacturing organization (preferably in the pharmaceutical industry) or in a business consulting firm.\n• Prior experience in FMCG or Pharma, working in the Sales & Marketing/Sales Force Excellence areas.\n• Working with data for insights delivery to senior management/leadership teams.\n\nKey Personal Attributes\n• Good communication skills, reasoning, and analytical ability.\n• Must be collaborative in approach and a team player.\n• Very good at networking and influencing.\n• Willingness to learn new concepts, tools, and techniques related to the subject.\n\nAbout Us\n\nWe help consult and deliver solutions to organizations where data is at the core of decision making. We undertake strategic data consulting for organizations in laying out the roadmap for data driven decision making, in order to equip organizations to convert data into a strategic differentiator. Through a host of our product and service offerings we analyse and visualize large amounts of data.\n\nTo know more about us visit Gramener Website and Gramener Blog.\n\nApply for this role Apply for this Role",
  "employment_type": "Full-time",
  "posted_at": null,
  "apply_link": "https://in.linkedin.com/jobs/view/lead-data-scientist-%E2%80%93-sfe-analytics-at-gramener-4255708863?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
  "salary": "Not specified"
}