{
  "title": "Data Science Lead",
  "company": "House of Shipping",
  "location": "Hyderabad",
  "description": "Company Brief\n\nHouse of Shipping provides business consultancy and advisory services for Shipping & Logistics companies. House of Shipping's commitment to their customers begins with developing an understanding of their business fundamentals. We are hiring on behalf of one of our key US based client - a globally recognized service provider of flexible and scalable outsourced warehousing solutions, designed to adapt to the evolving demands of today’s supply chains.\n\nCurrently House of Shipping is looking to identify a high caliber Data Science Lead.\n\nThis position is an on-site position for Hyderabad.\n\nBackground and experience:\n• 15–18 years in data science, with 5+ years in leadership roles\n• Proven track record in building and scaling data science teams in logistics, e-commerce, or manufacturing\n• Strong understanding of statistical learning, ML architecture, productionizing models, and impact tracking\n\nJob purpose:\n\nTo lead enterprise-scale data science initiatives in supply chain optimization, forecasting, network analytics, and predictive maintenance. This role blends technical leadership with strategic alignment across business units and manages advanced analytics teams to deliver measurable business impact.\n\nMain tasks and responsibilities:\n• Define and drive the data science roadmap across forecasting (demand, returns), route optimization, warehouse simulation, inventory management, and fraud detection\n• Architect end-to-end pipelines with engineering teams: from data ingestion, model development, to API deployment\n• Lead the design and deployment of ML models using Python (Scikit-Learn, XGBoost, PyTorch, LightGBM), and MLOps tools like MLflow, Vertex AI, or AWS SageMaker\n• Collaborate with operations, product, and technology to prioritize AI use cases and define business metrics\n• Manage experimentation frameworks (A/B testing, simulation models) and statistical hypothesis testing\n• Mentor team members in model explainability, interpretability, and ethical AI practices\n• Ensure robust model validation, drift monitoring, retraining schedules, and version control\n• Contribute to organizational data maturity: feature stores, reusable components, metadata tracking\n• Own team hiring, capability development, project estimation, and stakeholder presentations\n• Collaborate with external vendors, universities, and open-source projects where applicable\n\nEducation requirements:\n\nBachelor’s or Master’s or PhD in Computer Science, Mathematics, Statistics, Operations Research\n\nPreferred: Certifications in Cloud ML stacks (AWS/GCP/Azure), MLOps, or Applied AI\n\nCompetencies and skills:\n• Strategic vision in AI applications across supply chain\n• Team mentorship and delivery ownership\n• Expertise in statistical and ML frameworks\n• MLOps pipeline management and deployment best practices\n• Strong business alignment and executive communication",
  "employment_type": "Full-time",
  "posted_at": "2025-07-18T00:00:00.000Z",
  "apply_link": "https://in.linkedin.com/jobs/view/data-science-lead-at-house-of-shipping-4268881703?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
  "salary": "Not specified"
}