[
  {
    "job_id": "44TltshBunenOgDoAAAAAA==",
    "job_title": "Lead Data Scientist - 6+years (Data Science/Machine Learning/Data Analytics)",
    "employer_name": "Silicon Labs",
    "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcThJAa_tD4qsO3_O9Z-7ZsSZyHGOD8JbX-SY6VW&s=0",
    "employer_website": "http://www.silabs.com/",
    "job_publisher": "LinkedIn",
    "job_employment_type": "Full-time",
    "job_employment_types": [
      "FULLTIME"
    ],
    "job_apply_link": "https://in.linkedin.com/jobs/view/lead-data-scientist-6%2Byears-data-science-machine-learning-data-analytics-at-silicon-labs-4262154111?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "job_apply_is_direct": false,
    "apply_options": [
      {
        "publisher": "LinkedIn",
        "apply_link": "https://in.linkedin.com/jobs/view/lead-data-scientist-6%2Byears-data-science-machine-learning-data-analytics-at-silicon-labs-4262154111?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "is_direct": false
      },
      {
        "publisher": "Jooble",
        "apply_link": "https://in.jooble.org/jdp/4278821411924295659?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "is_direct": false
      },
      {
        "publisher": "Adzuna",
        "apply_link": "https://www.adzuna.in/details/5301592799?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "is_direct": false
      },
      {
        "publisher": "Expertini",
        "apply_link": "https://in.expertini.com/jobs/job/lead-data-scientist-6years-data-sciencemachine-learningdata-analytics-hyderabad-silicon-labs-4187-12730903/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "is_direct": false
      },
      {
        "publisher": "Jobrapido.com",
        "apply_link": "https://in.jobrapido.com/jobpreview/5050762410588110848?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "is_direct": false
      },
      {
        "publisher": "Recruit.net",
        "apply_link": "https://www.recruit.net/job/data-scientist-years-data-science-jobs/AC9EAAB5514A20EE?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "is_direct": false
      }
    ],
    "job_description": "Silicon Labs (NASDAQ: SLAB) is the leading innovator in low-power wireless connectivity, building embedded technology that connects devices and improves lives. Merging cutting-edge technology into the world’s most highly integrated SoCs, Silicon Labs provides device makers the solutions, support, and ecosystems needed to create advanced edge connectivity applications. Headquartered in Austin, Texas, Silicon Labs has operations in over 16 countries and is the trusted partner for innovative solutions in the smart home, industrial IoT, and smart cities markets. Learn more at www.silabs.com.\n\nWhat You'll do\n\nLead and execute complex data science initiatives that support high-impact business decisions.\n\nResponsible for the development, deployment, and communication of advanced analytical models.\n\nProvides technical guidance to junior data scientists and partners closely with cross-functional teams to drive data-driven outcomes\n\nResponsibilities\n• Designs and implements advanced statistical and machine learning models to solve complex business problems.\n• Leads full-cycle analytics projects, including problem definition, data exploration, model development, evaluation, and deployment.\n• Collaborates with stakeholders to align data science solutions with business goals and priorities.\n• Provides technical mentorship to junior team members and contributes to knowledge sharing across the team.\n• Translates complex modeling outputs into actionable insights and presents findings to senior leadership.\n• Stays current on industry best practices and emerging trends in AI, machine learning, and data science tools.\n• Contributes to continuous improvement in analytical workflows, code standards, and data governance.\n• Applies sound judgment to navigate ambiguous problems and propose scalable solutions.\n• Performs other duties as required in support of the data science team and organizational goals.\n\nRequired Qualification and skills\n• Bachelor’s degree in Data Science, Computer Science, Statistics, Mathematics, or a related field; Master’s preferred.\n• Minimum of 4 years of experience in data science, machine learning, or advanced analytics.\n• Advanced proficiency in Python or R, SQL, and machine learning libraries (e.g., scikit-learn, TensorFlow).\n• Strong grasp of statistical analysis, experimental design, and model evaluation techniques.\n• Excellent written and verbal communication skills, with the ability to influence both technical and non-technical stakeholders.\n• Demonstrated experience in leading complex data projects and driving measurable business outcomes.\n• Experience with cloud-based data platforms (e.g., AWS, GCP, Azure) and MLOps practices is a plus.\n\nBenefits & Perks:\n\nNot only will you be joining a highly skilled and tight-knit team where every engineer makes a significant impact on the product; we also strive for good work/life balance and to make our environment welcoming and fun.\n• Equity Rewards (RSUs)\n• Employee Stock Purchase Plan (ESPP)\n• Insurance plans with Outpatient cover\n• National Pension Scheme (NPS)\n• Flexible work policy\n• Childcare support\n\nSilicon Labs is an equal opportunity employer and values the diversity of our employees. Employment decisions are made on the basis of qualifications and job-related criteria without regard to race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status, or any other characteristic protected by applicable law.",
    "job_is_remote": false,
    "job_posted_at": "20 days ago",
    "job_posted_at_timestamp": 1751846400,
    "job_posted_at_datetime_utc": "2025-07-07T00:00:00.000Z",
    "job_location": "Hyderabad, Telangana, India",
    "job_city": "Hyderabad",
    "job_state": "Telangana",
    "job_country": "IN",
    "job_latitude": 17.406498,
    "job_longitude": 78.47724389999999,
    "job_benefits": null,
    "job_google_link": "https://www.google.com/search?q=jobs&gl=us&hl=en&udm=8#vhid=vt%3D20/docid%3D44TltshBunenOgDoAAAAAA%3D%3D&vssid=jobs-detail-viewer",
    "job_salary": null,
    "job_min_salary": null,
    "job_max_salary": null,
    "job_salary_period": null,
    "job_highlights": {},
    "job_onet_soc": "15111100",
    "job_onet_job_zone": "5"
  },
  {
    "job_id": "eXH8xI7r9TL2k86LAAAAAA==",
    "job_title": "Team Lead, Data Analysis",
    "employer_name": "Zelis",
    "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSpYNEuVTW2UpTsVXWskn06PmVXnrA8EB6FbJjd&s=0",
    "employer_website": "http://www.zelis.com/",
    "job_publisher": "LinkedIn",
    "job_employment_type": "Full-time",
    "job_employment_types": [
      "FULLTIME"
    ],
    "job_apply_link": "https://in.linkedin.com/jobs/view/team-lead-data-analysis-at-zelis-4275569263?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "job_apply_is_direct": false,
    "apply_options": [
      {
        "publisher": "LinkedIn",
        "apply_link": "https://in.linkedin.com/jobs/view/team-lead-data-analysis-at-zelis-4275569263?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "is_direct": false
      },
      {
        "publisher": "Glassdoor",
        "apply_link": "https://www.glassdoor.co.in/job-listing/team-lead-data-analysis-zelis-JV_IC2865319_KO0,23_KE24,29.htm?jl=1009822818216&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "is_direct": false
      },
      {
        "publisher": "Built In",
        "apply_link": "https://builtin.com/job/team-lead-data-analysis/6723881?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "is_direct": false
      },
      {
        "publisher": "Edison Partners Job Board",
        "apply_link": "https://jobs.edisonpartners.com/companies/zelis/jobs/55091007-team-lead-data-analysis?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "is_direct": false
      },
      {
        "publisher": "Glassdoor",
        "apply_link": "https://www.glassdoor.com/job-listing/team-lead-data-analysis-zelis-JV_IC2865319_KO0,23_KE24,29.htm?jl=1009822818216&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "is_direct": false
      },
      {
        "publisher": "Swooped",
        "apply_link": "https://swooped.co/job-postings/team-lead-data-analysis-india-hyderabad-zelis-6ac19?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "is_direct": false
      },
      {
        "publisher": "Talentify",
        "apply_link": "https://www.talentify.io/job/team-lead-data-analysis-hyderabad-telangana-in-zelis-jr109004?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "is_direct": false
      },
      {
        "publisher": "BeBee",
        "apply_link": "https://in.bebee.com/job/db2d97cc111b3345b4c702d87d45fa7e?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "is_direct": false
      }
    ],
    "job_description": "About Us\n\nZelis is modernizing the healthcare financial experience in the United States (U.S.) across payers, providers, and healthcare consumers. We serve more than 750 payers, including the top five national health plans, regional health plans, TPAs and millions of healthcare providers and consumers across our platform of solutions. Zelis sees across the system to identify, optimize, and solve problems holistically with technology built by healthcare experts – driving real, measurable results for clients.\n\nWhy We Do What We Do\n\nIn the U.S., consumers, payers, and providers face significant challenges throughout the healthcare financial journey. Zelis helps streamline the process by offering solutions that improve transparency, efficiency, and communication among all parties involved. By addressing the obstacles that patients face in accessing care, navigating the intricacies of insurance claims, and the logistical challenges healthcare providers encounter with processing payments, Zelis aims to create a more seamless and effective healthcare financial system.\n\nZelis India plays a crucial role in this mission by supporting various initiatives that enhance the healthcare financial experience. The local team contributes to the development and implementation of innovative solutions, ensuring that technology and processes are optimized for efficiency and effectiveness. Beyond operational expertise, Zelis India cultivates a collaborative work culture, leadership development, and global exposure, creating a dynamic environment for professional growth. With hybrid work flexibility, comprehensive healthcare benefits, financial wellness programs, and cultural celebrations, we foster a holistic workplace experience. Additionally, the team plays a vital role in maintaining high standards of service delivery and contributes to Zelis’ award-winning culture. \n\nPosition Overview\n\nThe UAT Team lead will be responsible for responsible for leading operational teams to meet client and internal team expectations in a timely, efficient manner. Should be able to work with creating and monitoring test plan, test scenarios, setup, execution of UAT testing and reviewing results for all healthcare claim editing related projects within the Payment Integrity department including but not limited to the testing of new data driven edits, configuration, platform initiatives, and UI initiatives. The individual must work well in a fast-paced, demanding environment and work towards process improvement along with daily tasks.\n\nObjECTIVES AND RESPONSIBILITIES\n• Supervises, coaches, and develop staff to ensure operational department expectations are met.\n• Regularly communicate any updates or changes in processes and documentation to all relevant team members, ensuring that the entire team is informed and aligned.\n• conducts weekly individual team meetings when necessary to advise departmental updates.\n• Assists in monitoring team and individual performance and KPIs to identify trends. Review and document staffing levels; coordinate Teams coverage to ensure operational deliveries are met.\n• Plans, coordinates, and organizes weekly reporting, monthly 1:1’s, and annual reviews.\n• Partners with recruiting and other matrix supervisors related to interviewing and hiring to ensure that our department is staffed with the best possible talent.\n• Reviews and handles timecard approvals and time off requests.\n• Respond and resolve escalated issues and assigned projects.\n• Improve operational management systems, processes, and best practices.\n• Perform end to end testing to ensure appropriate functionality, product integrity, accuracy, and quality of all changes and enhancements of the edit platform, Data Driven Edits PriZem (in-house system), Visium through the Payment Integrity (Claims Editing) process.\n• Analyze clinical and technical requirements and define the scope of UAT testing. Setup, develop and maintain detailed test scenarios, test suites, data, checklist and/or other documents as specified, ensuring test scenarios align to requirements, adhering to claim adjudication guidelines. While using best practices for software testing methodology and techniques.\n• Analyze and troubleshoot erroneous results, determine root cause, and suggest solutions.\n• Produce documents that are detailed, accurate, and in a consistent format, demonstrating strong analytical and documentation skills.\n• Continuous improvement and refinement of tests-based pre-production validation, post-production results and feedback from other groups (Configuration Department, Content Department and Operations teams) as needed.\n• Support multiple projects, initiatives, tasks, and maintenance releases while adhering to deadlines.\n• Maintain awareness of and ensure adherence to Zelis standards regarding privacy.\n\nWhat You Will Bring\n• Aptitude for problem-solving with technical skills to execute\n• Excellent problem solving and analytical skills.\n• Ability to prioritize and manage multiple concurrent projects.\n• Ability to work through others without direct supervisory responsibility within departments and across the organization.\n• Understanding medical coding and medical claims.\n• Understanding of the life of a claim, including adjusted/corrected claims.\n• Excellent attention to detail to assess issues and resolve in a timely manner.\n• Basic database skills using MS SQL.\n• Ability to identify key factors and decisions that will make a project successful.\n• Ability to see the big picture and learn new processes, technologies and envision how they could benefit Zelis.\n• Must have excellent communication and presentation skills to effectively interface with team members.\n\nEducation\n• 2-3 years of relevant experience or equivalent combination of education & work within healthcare payer or provider.\n• Knowledge of healthcare reimbursement methodologies and acceptable billing practices.\n• Knowledge of payer reimbursement policies, state and federal regulations and applicable industry standards.\n• Knowledge of claims adjudication process and interpret claim editing rules.\n• Certified coder (CCS, CCS-P or CPC), or registered health information technician (RHIA/RHIT), or RN, LPN with coding knowledge a plus.\n• Understanding of SQL Server 2000/2005/2008 is a plus.\n• Project management experience a plus.\n• Excellent written, oral and presentation skills and ability to communicate complex concepts.\n• Proficient in Microsoft Office, Word, Excel.",
    "job_is_remote": false,
    "job_posted_at": "2 days ago",
    "job_posted_at_timestamp": 1753401600,
    "job_posted_at_datetime_utc": "2025-07-25T00:00:00.000Z",
    "job_location": "Hyderabad, Telangana, India",
    "job_city": "Hyderabad",
    "job_state": "Telangana",
    "job_country": "IN",
    "job_latitude": 17.406498,
    "job_longitude": 78.47724389999999,
    "job_benefits": null,
    "job_google_link": "https://www.google.com/search?q=jobs&gl=us&hl=en&udm=8#vhid=vt%3D20/docid%3DeXH8xI7r9TL2k86LAAAAAA%3D%3D&vssid=jobs-detail-viewer",
    "job_salary": null,
    "job_min_salary": null,
    "job_max_salary": null,
    "job_salary_period": null,
    "job_highlights": {},
    "job_onet_soc": "43911100",
    "job_onet_job_zone": "4"
  },
  {
    "job_id": "J9Co6vAISQN4q8fYAAAAAA==",
    "job_title": "Lead Data Scientist – SFE Analytics",
    "employer_name": "Gramener",
    "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRYvr0qpAbOdXcL8ecTPa-d5oH-FMIfXxsv2_6E&s=0",
    "employer_website": "http://gramener.com/",
    "job_publisher": "LinkedIn",
    "job_employment_type": "Full-time",
    "job_employment_types": [
      "FULLTIME"
    ],
    "job_apply_link": "https://in.linkedin.com/jobs/view/lead-data-scientist-%E2%80%93-sfe-analytics-at-gramener-4255708863?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "job_apply_is_direct": false,
    "apply_options": [
      {
        "publisher": "LinkedIn",
        "apply_link": "https://in.linkedin.com/jobs/view/lead-data-scientist-%E2%80%93-sfe-analytics-at-gramener-4255708863?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "is_direct": false
      },
      {
        "publisher": "Jobs.weekday.works",
        "apply_link": "https://jobs.weekday.works/gramener-lead-data-scientist-%E2%80%93-sfe-analytics?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "is_direct": true
      }
    ],
    "job_description": "Work Location: Hyderabad\n\nWhat Gramener offers you\n\nGramener will offer you an inviting workplace, talented colleagues from diverse backgrounds, career path, steady growth prospects with great scope to innovate. Our goal is to create an ecosystem of easily configurable data applications focused on storytelling for public and private use\n\nRoles and Responsibilities\n• Worked extensively on SFE Analytics (Pharma preferred).\n• Deep understanding of Pharma Data (internal & external), best practices, and utilization of the data to drive the needed outcomes.\n• Strong expertise & understanding of the analytics to perform (at least 2 out of 4):\n\n– Territory designing & balancing. – FF alignment. – Call planning management. – Incentive & target management.\n• Analysing cross-channel marketing & commercial interventions, help build use case, value estimation & implementation.\n• Work with the business/functional users to understand the business decision-making and sales & marketing process challenges to recommend data-led solutions.\n• Assist in collecting, cleaning, and pre-processing data from various sources to build usable datasets.\n• Leverage advanced data analytics to address the business needs and create a business impact.\n• Design data science solutions in collaboration with technology architects to address this need.\n• Strong affiliation with quantitative methods and data analysis to deliver business insights.\n• Technical skills required (non-Negotiable): Excel, SQL, Python / R.\n\nSkills And Qualifications\n• Minimum 4+ years of experience in a reputed medium to large-scale manufacturing organization (preferably in the pharmaceutical industry) or in a business consulting firm.\n• Prior experience in FMCG or Pharma, working in the Sales & Marketing/Sales Force Excellence areas.\n• Working with data for insights delivery to senior management/leadership teams.\n\nKey Personal Attributes\n• Good communication skills, reasoning, and analytical ability.\n• Must be collaborative in approach and a team player.\n• Very good at networking and influencing.\n• Willingness to learn new concepts, tools, and techniques related to the subject.\n\nAbout Us\n\nWe help consult and deliver solutions to organizations where data is at the core of decision making. We undertake strategic data consulting for organizations in laying out the roadmap for data driven decision making, in order to equip organizations to convert data into a strategic differentiator. Through a host of our product and service offerings we analyse and visualize large amounts of data.\n\nTo know more about us visit Gramener Website and Gramener Blog.\n\nApply for this role Apply for this Role",
    "job_is_remote": false,
    "job_posted_at": null,
    "job_posted_at_timestamp": null,
    "job_posted_at_datetime_utc": null,
    "job_location": "Hyderabad, Telangana, India",
    "job_city": "Hyderabad",
    "job_state": "Telangana",
    "job_country": "IN",
    "job_latitude": 17.406498,
    "job_longitude": 78.47724389999999,
    "job_benefits": null,
    "job_google_link": "https://www.google.com/search?q=jobs&gl=us&hl=en&udm=8#vhid=vt%3D20/docid%3DJ9Co6vAISQN4q8fYAAAAAA%3D%3D&vssid=jobs-detail-viewer",
    "job_salary": null,
    "job_min_salary": null,
    "job_max_salary": null,
    "job_salary_period": null,
    "job_highlights": {},
    "job_onet_soc": "15204100",
    "job_onet_job_zone": "5"
  },
  {
    "job_id": "VH_wq0IHZZdEb4-7AAAAAA==",
    "job_title": "Data Science Lead",
    "employer_name": "House of Shipping",
    "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQfwDxa5GQVgfLf4IcSjBERDmSLJfgvX0XlWyMv&s=0",
    "employer_website": "https://houseofshipping.com",
    "job_publisher": "LinkedIn",
    "job_employment_type": "Full-time",
    "job_employment_types": [
      "FULLTIME"
    ],
    "job_apply_link": "https://in.linkedin.com/jobs/view/data-science-lead-at-house-of-shipping-4268881703?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "job_apply_is_direct": false,
    "apply_options": [
      {
        "publisher": "LinkedIn",
        "apply_link": "https://in.linkedin.com/jobs/view/data-science-lead-at-house-of-shipping-4268881703?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "is_direct": false
      },
      {
        "publisher": "Shine",
        "apply_link": "https://www.shine.com/jobs/data-science-lead/house-of-shipping/17513733?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "is_direct": false
      },
      {
        "publisher": "Expertini",
        "apply_link": "https://in.expertini.com/jobs/job/data-science-lead-hyderabad-house-of-shipping-315-48302663/amp/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "is_direct": false
      },
      {
        "publisher": "Jobs Trabajo.org",
        "apply_link": "https://in.trabajo.org/job-3150-f500a8c426bcbfee94dde370b1d1558f?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "is_direct": false
      },
      {
        "publisher": "Jobs.weekday.works",
        "apply_link": "https://jobs.weekday.works/algoleap-technologies-pvt-ltd-data-science-lead?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "is_direct": true
      },
      {
        "publisher": "Jobrapido.com",
        "apply_link": "https://in.jobrapido.com/jobpreview/8237376837093687296?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "is_direct": false
      },
      {
        "publisher": "WhatJobs",
        "apply_link": "https://en-in.whatjobs.com/jobs/data-analysis?id=161686465&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "is_direct": false
      }
    ],
    "job_description": "Company Brief\n\nHouse of Shipping provides business consultancy and advisory services for Shipping & Logistics companies. House of Shipping's commitment to their customers begins with developing an understanding of their business fundamentals. We are hiring on behalf of one of our key US based client - a globally recognized service provider of flexible and scalable outsourced warehousing solutions, designed to adapt to the evolving demands of today’s supply chains.\n\nCurrently House of Shipping is looking to identify a high caliber Data Science Lead.\n\nThis position is an on-site position for Hyderabad.\n\nBackground and experience:\n• 15–18 years in data science, with 5+ years in leadership roles\n• Proven track record in building and scaling data science teams in logistics, e-commerce, or manufacturing\n• Strong understanding of statistical learning, ML architecture, productionizing models, and impact tracking\n\nJob purpose:\n\nTo lead enterprise-scale data science initiatives in supply chain optimization, forecasting, network analytics, and predictive maintenance. This role blends technical leadership with strategic alignment across business units and manages advanced analytics teams to deliver measurable business impact.\n\nMain tasks and responsibilities:\n• Define and drive the data science roadmap across forecasting (demand, returns), route optimization, warehouse simulation, inventory management, and fraud detection\n• Architect end-to-end pipelines with engineering teams: from data ingestion, model development, to API deployment\n• Lead the design and deployment of ML models using Python (Scikit-Learn, XGBoost, PyTorch, LightGBM), and MLOps tools like MLflow, Vertex AI, or AWS SageMaker\n• Collaborate with operations, product, and technology to prioritize AI use cases and define business metrics\n• Manage experimentation frameworks (A/B testing, simulation models) and statistical hypothesis testing\n• Mentor team members in model explainability, interpretability, and ethical AI practices\n• Ensure robust model validation, drift monitoring, retraining schedules, and version control\n• Contribute to organizational data maturity: feature stores, reusable components, metadata tracking\n• Own team hiring, capability development, project estimation, and stakeholder presentations\n• Collaborate with external vendors, universities, and open-source projects where applicable\n\nEducation requirements:\n\nBachelor’s or Master’s or PhD in Computer Science, Mathematics, Statistics, Operations Research\n\nPreferred: Certifications in Cloud ML stacks (AWS/GCP/Azure), MLOps, or Applied AI\n\nCompetencies and skills:\n• Strategic vision in AI applications across supply chain\n• Team mentorship and delivery ownership\n• Expertise in statistical and ML frameworks\n• MLOps pipeline management and deployment best practices\n• Strong business alignment and executive communication",
    "job_is_remote": false,
    "job_posted_at": "9 days ago",
    "job_posted_at_timestamp": 1752796800,
    "job_posted_at_datetime_utc": "2025-07-18T00:00:00.000Z",
    "job_location": "Hyderabad, Telangana, India",
    "job_city": "Hyderabad",
    "job_state": "Telangana",
    "job_country": "IN",
    "job_latitude": 17.406498,
    "job_longitude": 78.47724389999999,
    "job_benefits": null,
    "job_google_link": "https://www.google.com/search?q=jobs&gl=us&hl=en&udm=8#vhid=vt%3D20/docid%3DVH_wq0IHZZdEb4-7AAAAAA%3D%3D&vssid=jobs-detail-viewer",
    "job_salary": null,
    "job_min_salary": null,
    "job_max_salary": null,
    "job_salary_period": null,
    "job_highlights": {},
    "job_onet_soc": "15111100",
    "job_onet_job_zone": "5"
  },
  {
    "job_id": "EdxQabATkaB6tPKAAAAAAA==",
    "job_title": "Data Scientist Lead - Data Analytics",
    "employer_name": "JPMorgan Chase & Co.",
    "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRox1cV1iMaZHBIPfI8eSZWczRSu5EFdpRLE9pS&s=0",
    "employer_website": "http://www.jpmorganchase.com/",
    "job_publisher": "Expertini",
    "job_employment_type": "Full-time",
    "job_employment_types": [
      "FULLTIME"
    ],
    "job_apply_link": "https://in.expertini.com/jobs/job/data-scientist-lead-data-analytics-hyderabad-jpmorgan-chase-co-1831-16184663/amp/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "job_apply_is_direct": false,
    "apply_options": [
      {
        "publisher": "Expertini",
        "apply_link": "https://in.expertini.com/jobs/job/data-scientist-lead-data-analytics-hyderabad-jpmorgan-chase-co-1831-16184663/amp/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "is_direct": false
      },
      {
        "publisher": "Jobrapido.com",
        "apply_link": "https://in.jobrapido.com/jobpreview/795999564711591936?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "is_direct": false
      },
      {
        "publisher": "Dr. Job Pro",
        "apply_link": "https://www.drjobpro.com/job/view/M942ZMEC085TO2E?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
        "is_direct": true
      }
    ],
    "job_description": "We offer a unique opportunity to collaborate with brilliant minds and deliver premier solutions that set a new standard.\n\nAs a Data Scientist lead within the Data and Analytics team, you will drive the analytics book of work, transforming Chase’s cross-channel, cross-line of business acquisition strategy to a hyper-personalized, data-driven, customer-centric model. You will partner strategically across the firm with marketers, channel owners, digital experts, and the broader analytics community to help drive business goals through deep understanding of marketing analytics and optimization.\n\nJob Responsibilities:\n• Develop the analytics framework and data infrastructure necessary to support the platform team in evaluating value addition.\n• Define and assess the OKRs and goals related to the platform's performance.\n• Provide top-tier business intelligence through dashboards and executive reporting to the Acquisitions Center of Excellence and Line of Business leadership.\n• Construct business cases that drive prioritization and investment in Acquisition & Enablement Platforms.\n• Communicate effectively with product, technology, data, and design teams to identify and advance a data-driven analytical roadmap.\n• Serve as the Acquisition Center of Excellence Analytics local site lead, overseeing local operations and contributing to the expansion of the team's presence in India.\n\nRequired Qualifications, Capabilities, and Skills:\n• 5+ years leveraging data visualization tools for data exploration and marketing performance evaluation.\n• Proven ability to lead and manage teams effectively, showcasing strong leadership skills.\n• Experience in querying big data platforms and SAS/SQL.\n• Comfort building and managing relationships with both analytics and business stakeholders.\n• Proven track record of problem-solving using data and building new analytics capabilities. Talent for translating numbers into an actionable story for business leaders.\n• Experience with best-in-class web analytic tools (Google Analytics, Adobe/Omniture Insight/Visual Sciences, Webtrends, CoreMetrics, .\n• Superior written, oral communication and presentation skills with experience communicating concisely and effectively with all levels of management and partners.\n• Bachelor’s degree is required, with data science, mathematics, statistics, econometrics, engineering, MIS, finance, or related fields accordingly.\n\nPreferred Qualifications, Capabilities, and Skills:\n• Financial services experience preferred.\n• Tableau experience preferred.\n• Familiarity with Teradata, AWS, & Snowflake preferred.",
    "job_is_remote": false,
    "job_posted_at": "15 days ago",
    "job_posted_at_timestamp": 1752278400,
    "job_posted_at_datetime_utc": "2025-07-12T00:00:00.000Z",
    "job_location": "Hyderabad, Telangana, India",
    "job_city": "Hyderabad",
    "job_state": "Telangana",
    "job_country": "IN",
    "job_latitude": 17.406498,
    "job_longitude": 78.47724389999999,
    "job_benefits": null,
    "job_google_link": "https://www.google.com/search?q=jobs&gl=us&hl=en&udm=8#vhid=vt%3D20/docid%3DEdxQabATkaB6tPKAAAAAAA%3D%3D&vssid=jobs-detail-viewer",
    "job_salary": null,
    "job_min_salary": null,
    "job_max_salary": null,
    "job_salary_period": null,
    "job_highlights": {},
    "job_onet_soc": "15111100",
    "job_onet_job_zone": "5"
  }
]